##### Handle Categorical Features

##### One Hot Encoding

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('titanic.csv', usecols = ['Sex'])

In [4]:
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [7]:
pd.get_dummies(df, drop_first = True).head()

   Sex_male
0         1
1         0
2         0
3         0
4         1

In [8]:
df = pd.read_csv('titanic.csv', usecols = ['Embarked'])

In [9]:
df.head()

  Embarked
0        S
1        C
2        S
3        S
4        S

In [10]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [11]:
df.dropna(inplace = True)

In [12]:
df.head()

  Embarked
0        S
1        C
2        S
3        S
4        S

In [14]:
pd.get_dummies(df, drop_first = True).head() # n - 1 features when we do get_dummies

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1

### OneHotEncoding with many categories in a feature

In [17]:
df = pd.read_csv('mercedes.csv', usecols = ['X0', 'X1', 'X2', 'X3', 'X4', 'X5', 'X6'])

In [18]:
df.head()

   X0 X1  X2 X3 X4 X5 X6
0   k  v  at  a  d  u  j
1   k  t  av  e  d  y  l
2  az  w   n  c  d  x  j
3  az  t   n  f  d  x  l
4  az  v   n  f  d  h  d

In [19]:
df['X0'].value_counts()

z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
j     181
az    175
aj    151
s     106
ap    103
h      75
d      73
al     67
v      36
af     35
m      34
ai     34
e      32
ba     27
at     25
a      21
ax     19
aq     18
am     18
i      18
u      17
aw     16
l      16
ad     14
au     11
k      11
b      11
r      10
as     10
bc      6
ao      4
c       3
aa      2
q       2
ac      1
g       1
ab      1
Name: X0, dtype: int64

In [20]:
df['X0'].unique()

array(['k', 'az', 't', 'al', 'o', 'w', 'j', 'h', 's', 'n', 'ay', 'f', 'x',
       'y', 'aj', 'ak', 'am', 'z', 'q', 'at', 'ap', 'v', 'af', 'a', 'e',
       'ai', 'd', 'aq', 'c', 'aa', 'ba', 'as', 'i', 'r', 'b', 'ax', 'bc',
       'u', 'ad', 'au', 'm', 'l', 'aw', 'ao', 'ac', 'g', 'ab'],
      dtype=object)

In [21]:
print(len(df['X0'].unique()))

47

In [22]:
for i in df.columns:
    print(len(df[i].unique()))
    
# Here using OHE endoding techniques will not be useful as many more categories will be created

47
27
44
7
4
29
12

In [24]:
df.X1.value_counts().sort_values(ascending = False).head(10)
# kdd cup orange challenge used this technique of using top 10 categories having much data and dropping others

aa    833
s     598
b     592
l     590
v     408
r     251
i     203
a     143
c     121
o      82
Name: X1, dtype: int64

In [26]:
lst_10 = df.X1.value_counts().sort_values(ascending = False).head(10).index
lst_10 = list(lst_10)

In [27]:
lst_10
# Now we will apply OHE only on the top 10 features

['aa', 's', 'b', 'l', 'v', 'r', 'i', 'a', 'c', 'o']

In [28]:
import numpy as np
for categories in lst_10:
    df[categories] = np.where(df['X1'] == categories, 1, 0)

In [33]:
lst_10.append('X1')

In [34]:
df[lst_10]

      aa  s  b  l  v  r  i  a  c  o X1
0      0  0  0  0  1  0  0  0  0  0  v
1      0  0  0  0  0  0  0  0  0  0  t
2      0  0  0  0  0  0  0  0  0  0  w
3      0  0  0  0  0  0  0  0  0  0  t
4      0  0  0  0  1  0  0  0  0  0  v
...   .. .. .. .. .. .. .. .. .. .. ..
4204   0  1  0  0  0  0  0  0  0  0  s
4205   0  0  0  0  0  0  0  0  0  1  o
4206   0  0  0  0  1  0  0  0  0  0  v
4207   0  0  0  0  0  1  0  0  0  0  r
4208   0  0  0  0  0  1  0  0  0  0  r

[4209 rows x 11 columns]